sslivins/bala2fire/sdkconfig.defaults
# M5Stack Fire / Bala2 Fire defaults
CONFIG_IDF_TARGET="esp32"

# 16 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 4 MB PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Higher CPU clock for balancing loop
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# C++ exceptions off (M5Unified uses RTTI but not exceptions)
CONFIG_COMPILER_CXX_RTTI=y

# 1 kHz FreeRTOS tick so the 200 Hz balancer loop has 5 ms resolution.
# (Default is 100 Hz, which rounds pdMS_TO_TICKS(5) to 0 ticks.)
CONFIG_FREERTOS_HZ=1000

# Angle PID direction: tested on-hardware. The default direction had
# wheels driving INTO the fall; flipping to POS=y was previously logged
# as the fix, but on the current bot the wheels still spin backward
# during balance. Flip back to negative direction.
# CONFIG_BALANCER_ANGLE_DIR_POS is not set

# Bumped balance gains toward the reference impl. Verified on hardware:
# at kp=24 / kd=90 / PWM=400 the bot ran away from disturbances. At
# kp=24 / kd=180 / PWM=800 / setpoint=+1.0 the bot achieves stable
# balance (steady angle near 0 with PWM ~ ±40, no constant forward
# drive) but still can't reject disturbances >= ~6° before the fall
# becomes irrecoverable. Bumping PWM_LIMIT to the hardware max (1023)
# gives the angle PID full recovery authority during transients;
# steady-state is unaffected (steady PWM was ±40 << 1023).
CONFIG_BALANCER_PWM_LIMIT=1023
CONFIG_BALANCER_ANGLE_KP_MILLI=24000
CONFIG_BALANCER_ANGLE_KD_MILLI=180000

# Setpoint trim: this physical bot's "natural upright" sits at IMU
# angle ~+1.0° (observed during multiple stable-balance windows of
# 2-17 s: angle hovered at +0.9..+1.3° with steady PWM near +30
# driving the bot forward against the floor at setpoint=0). With
# setpoint=+1.0 the controller no longer drives forward in steady
# state; PWM hovers around 0 and the bot holds station.
#
# Reference impl uses -1.5° (their bot's calibrated angle_center).
# Same role, different per-bot value.
CONFIG_BALANCER_SETPOINT_MDEG=1000

# Speed PID direction: matches the M5Stack Bala2 reference impl
# (https://github.com/m5stack/M5-ProductExampleCodes/tree/master/Application/Bala2)
# which uses speed_pid.SetDirection(1). Earlier guess that this bot's
# encoder polarity required a flip turned out to be wrong — reverting.
CONFIG_BALANCER_SPEED_DIR_POS=y

# OTA partition layout (two ~3 MB app slots + 10 MB FAT) so we can flash
# new firmware over Wi-Fi via components/bala2_ota.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable rollback so a broken OTA reboots into the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA streams a ~1 MB POST body; allow generous HTTP recv timeouts and
# a slightly bigger HTTP server stack.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
